public_html/blog/2019/org-mode-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-03 二 11:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="renshuo" />
<link rel="stylesheet" type="text/css" href="/blog/public_html/theme/css/worg.css"/>
                       <link rel="stylesheet" type="text/css" href="theme/css/worg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org01c7a09"><span class="timestamp-wrapper"><span class="timestamp">[2019-08-27 二] </span></span> org-mode 笔记&#xa0;&#xa0;&#xa0;<span class="tag"><span class="orgmode">orgmode</span></span></a></li>
</ul>
</div>
</div>
<div id="outline-container-org01c7a09" class="outline-2">
<h2 id="org01c7a09"><span class="timestamp-wrapper"><span class="timestamp">[2019-08-27 二] </span></span> <a href="blog/2019/org-mode-notes.html">org-mode 笔记</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="orgmode">orgmode</span></span></h2>
<div class="outline-text-2" id="text-org01c7a09">
<ol class="org-ol">
<li>运行代码</li>
</ol>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>+ <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">C-c C-c</span>
</pre>
</div>
<ol class="org-ol">
<li>导出</li>
</ol>
<p class="verse">
C-c C-e 然后选择格式
</p>

<ol class="org-ol">
<li>日期</li>
</ol>
<pre class="example">
C-c ! 然后输入时间，即可插入非活动时间，非活动时间不在 agenda 上显示 [2019-08-27 二 12:12]
C-c . 插入活动时间  &lt;2019-08-27 二 12:00&gt;
C-u C-c ./! 直接插入带有时间的日期，其他同上两条 &lt;2019-08-27 二 10:15&gt; [2019-08-27 二 10:15]
C-c &lt; 插入当前时间戳 &lt;2019-08-26 一&gt;
C-c &gt; 打开 agenda
S-&lt;left&gt;/&lt;right&gt; 减少/增加 1 天
S-&lt;up&gt;/&lt;down&gt; 减少/增加光标所在位置时间字符串的数字
</pre>

<ol class="org-ol">
<li>calendar 中的命令</li>
</ol>
<pre class="example">
. 回到今天
C-f/b 向前/向后 一天
C-n/p 向前/向后 一周
M-{/} 向前/向后 一月
C-x [/] 向前/向后 一年
&gt;/&lt; 滚动一个月
M-v/C-v 滚动 3 个月
C-a/e 到一周的开始/结束
M-a/e 到一月的开始/结束
M-&lt;/&gt; 到一年的开始/结束
</pre>

<ol class="org-ol">
<li>快捷段落</li>
</ol>
<pre class="example">
s	#+BEGIN_SRC ... #+END_SRC
e	#+BEGIN_EXAMPLE ... #+END_EXAMPLE
q	#+BEGIN_QUOTE ... #+END_QUOTE
v	#+BEGIN_VERSE ... #+END_VERSE
c	#+BEGIN_CENTER ... #+END_CENTER
l	#+BEGIN_LaTeX ... #+END_LaTeX
L	#+LaTeX:
h	#+BEGIN_HTML ... #+END_HTML
H	#+HTML:
a	#+BEGIN_ASCII ... #+END_ASCII
A	#+ASCII:
i	#+INDEX: line
I	#+INCLUDE: linee
</pre>

<p>
用法如下，输入
</p>
<pre class="example">
&lt;e
</pre>
<p>
然后按 tab 键，即可补全为
</p>
<pre class="example">
#+BEGIN_EXAMPLE

#+END_EXAMPLE
</pre>

<ol class="org-ol">
<li>列表</li>
</ol>
<p>
有序的用 
</p>
<pre class="example">
1.  2. 3. ...
</pre>
<p>
无序的用
</p>
<pre class="example">
+ - *
</pre>
<p>
"*"会冲突
</p>
<ul class="org-ul">
<li>a</li>
<li>b
<ul class="org-ul">
<li>c</li>
</ul></li>
<li>d</li>

<li>字体相关</li>
</ul>
<pre class="example">
*bold*
/italic/
_underlined_
=verbatim=
~code~
----- 5 个以上相当于水平线
</pre>

<ol class="org-ol">
<li>表格</li>
</ol>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> 例子表格</caption>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-right">电话</th>
<th scope="col" class="org-right">年龄</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">任硕</td>
<td class="org-right">18092099708</td>
<td class="org-right">36</td>
</tr>

<tr>
<td class="org-left">刘薇</td>
<td class="org-right">18991844917</td>
<td class="org-right">39</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: renshuo</p>
<p class="date">Created: 2019-09-03 二 11:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
